[
{"post_name": "Non-technical engineering manager salary", "text": "For context, let's look at Europe for the most part as I'm located here. The IT market has pretty much levelled out here due to remote work.", "link": "/r/cscareerquestions/comments/pjjavf/nontechnical_engineering_manager_salary/", "comments": "0 comments"},
{"post_name": "Fresh out of HS wanting to get a job without a degree", "text": "Please let me know if this is the wrong way to post a question like this, or if it's redundant, etc. Apologies.", "link": "/r/cscareerquestions/comments/pjj8rv/fresh_out_of_hs_wanting_to_get_a_job_without_a/", "comments": "2 comments"},
{"post_name": "Is it just me or are CS classes are shit especially the higher level ones?", "text": "I went to uni for 3 years for mse and cs .dropped out worked for 2-3 years for 2 bluechips (no faang). I went back to college, the classes makes no sense you can somehow fail even if you have a high understand of topic taught through actually application. Lastly, too many classes are academic purpose only. If I didn't work or take cs with MSE, I probably would of missed out on my current career which I enjoy more than my college education so far would indicate. Duck \"standard practices\" what a dinosaur know about standard practices? All they are doing is building bad habits.", "link": "/r/cscareerquestions/comments/pjj8r9/is_it_just_me_or_are_cs_classes_are_shit/", "comments": "1 comment"},
{"post_name": "how long does it take to get a cs job without a degree", "text": "Hi, I'm currently 22 in college studying for an accounting degree, but cs seems like a great field to get into. My question is reallsitucy how would it take to get a job in cs from starting with no experience or skill, and what would you recommend starting with. Java,python etc etc where would you start. Thank you for advice", "link": "/r/cscareerquestions/comments/pjip8m/how_long_does_it_take_to_get_a_cs_job_without_a/", "comments": "1 comment"},
{"post_name": "What should I learn in context to switching job?", "text": "Hello, I have been working in a small company for almost 1 year and the only technologies I have working on are HTML, CSS , SASS, Jquery, JS(ES6),SCSS,.NET(MVC), PHP, Larvel, Wordpress. I know that these skills would not be useful in a big company.", "link": "/r/cscareerquestions/comments/pjimip/what_should_i_learn_in_context_to_switching_job/", "comments": "0 comments"},
{"post_name": "how long does it take to get a cs job without a degree", "text": "Hi im currently 22 in college studying for an accounting degree but cs seems like a great field to get into. My question is reallsitucy  how would it take to get a job in cs from starting with no experience or skill, and what would you recommend starting with. Java,python etc etc where would you start. Thank you for advice", "link": "/r/cscareerquestions/comments/pjiig7/how_long_does_it_take_to_get_a_cs_job_without_a/", "comments": "5 comments"},
{"post_name": "Career Guidance Survey", "text": "Hey guys! I know many of us in India don't have the privilege of choosing a career which we truly love. Due to this our team is trying to come up with a platform to create awareness among the students as well as the parents. In order to do this successfully, we need your help!", "link": "/r/cscareerquestions/comments/pjigdq/career_guidance_survey/", "comments": "0 comments"}
]